Tekla Open API Reference for Tekla Structures 2025
Matrix.Multiply Operator (Matrix, Point)
 Transforms the given point using the given matrix.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Point operator *(
	Matrix A,
	Point p
)
Public Shared Operator * (
	A As Matrix,
	p As Point
) As Point
Parameters
A
Type: Tekla.Structures.Geometry3d.Matrix
The transformation matrix.
p
Type: Tekla.Structures.Geometry3d.Point
The point to be transformed.
Return Value
Type: Point
The new transformed point.
See Also
Reference
Matrix Class
Multiply Overload
Tekla.Structures.Geometry3d Namespace